// // // Масиви та об'єкти:
// // // - Створити масив, наповнити його 10 елементами будь-якого типу, вивести кожен елемент в консоль
// // // - Створити 3 об'єкти які описують книги. Поля об'єкту : title ,pageCount, genre.
// // // - Створити 3 об'єкти які описують книги. Поля об'єкту : title ,pageCount, genre, authors. Поле "автори" - являється  масивом. Кожен автор має поля name та age.
// // // - Створити масив з 10 об'єктами які описують сутніть "користувач". Поля: name, username,password. Вивести в консоль пароль кожного користувача
// //
// // let array = [1, 2, 3, 4, 5];
// // console.log(array[0])
// //
// // const book = {
// //     title:'title_of_book',
// //     pageCount:3,
// //     genre: 'detective',
// //     authors:{
// //         author: 'John Doe',
// //     },
// // }
// //
// // const user = {
// //     login:'123456',
// //     password:'P@ssword',
// // }
//
// // - описати масив, в якому буде зберігатись інформація про температуру вранці, вдень і ввечері
// // за термін в 7 днів. Як зробити цей масив - вам потрібно подумати. Нормальних варіантів опису - 2.
// // Варіант, коли в вас буде одновимірний масив з 21 значенням вичключаємо одразу
//
//
// // const temperature = [
// //     {
// //         day:0,
// //         noon:-2,
// //         evening:-1,
// //     },
// //
// //     {
// //         day:0,
// //         noon:-2,
// //         evening:-1,
// //     },
// //
// //     {
// //         day:0,
// //         noon:-2,
// //         evening:-1,
// //     },
// //
// //     {
// //         day:0,
// //         noon:-2,
// //         evening:-1,
// //     },
// //
// //     {
// //         day:0,
// //         noon:-2,
// //         evening:-1,
// //     },
// //
// //     {
// //         day:0,
// //         noon:-2,
// //         evening:-1,
// //     },
// //
// //     {
// //         day:0,
// //         noon:-2,
// //         evening:-1,
// //     },
// //
// //     {
// //         day:0,
// //         noon:-2,
// //         evening:-1,
// //     },
// // ]
//
// // Логічні розгалуження:
// //     - Є змінна х, якій ви надаєте довільне числове значення.
// //     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте
// //     скрипт при a, що дорівнює 1, 0, -3
//
// // let x = prompt()
// //
// // if (x<0) {
// //     console.log('Меньше нуля')
// // } else {
// //     console.log('Больше нуля');
// // }
//
// // - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої
// // четверті години попадає число
//
//
// // (в першу, другу, третю или четверту частину години).
//
//
//
//
//
//
//
//
//
// // - У змінній day дано якесь число від 1 до 31. Потрібно визначити,
// // у яку половину(декаду) місяця
// // потрапляє це число (у першу, другу чи третю).
// // - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і
// // на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня
// // англійською).
//
//
//
// //     - Користувач вводить або має два числа.
// //         Потрібно знайти та вивести максимальне число з тих двох .
// //         Також потрібно врахувати коли введені рівні числа.
//
// let number1 = prompt("Enter a number 1: ");
// let number2 = prompt("Enter a number 2: ");
//
// if (number1 > number2) {
//     console.log(number1)
// } else if (number1 < number2) {
//     console.log(number2)
// } else if (number1 === number2) {
//     console.log(number1)
// }
//
//
//
//
